label chapter6_end5:
    "所以还是........算了吧......."
    "让那个“我”安静地过完一生吧......."
    "将我的记忆植入给他.....只会给他造成负担.........."
    "..................."
    "我敬畏地将手表摘下，放进它原本在的地方。"
    "好了，接下来该去做什么呢？"
    "...................."
    "...................."
    "我尝试性地再次拜访了叶梓澄父亲的研究所。"
    "您..........需要实验助手吗？"
    "............."
    "就这样,我成为了给叶梓澄父亲的研究所打工的助手。"
    "我失去了我原本的容身之所.......但是却获得了新的容身之所......"
    "这样倒也........挺好的......."
    "......................"
    "......................"
    "......................"
    "......................"
    "......................"
    "一晃十年过去了。"
    "顶着临近正午的太阳，我回到了我的母校。"
    "虽然不清楚没成功毕业的学校到底能不能叫母校。"
    "在校门口摆了个摊，象征性地卖一些文具和生活用品。"
    "但我的真实目的其实是："
    "想再看一眼那个我.......那个......无垢的我............"
    "这便是对我所做的一切的最好的奖励与报答了。"
    "证明我所做的一切并没有做错的......最好的报答........"
    "随着命中注定的公交车的停下，命中注定的那个我.....缓缓走了出来。"
    "朝我所在的方向看了看，慢慢走了过来。"
    "我那个时候真好啊~"
    "年轻中透着稚嫩。充满朝气和光明的未来。"
    "........."
    "他停在我的摊位面前，慢慢端详着我的商品。"
    "挑了几根笔，结账了。"
    ".........."
    "然后便准备离开了........."
    "等一下！！"
    "嗯？"
    "我还是忍不住.......叫住了他........"
    "祝你.....学业有成..........."
    "也希望你能找到新的朋友..............."
    "................"
    "谢谢！！"
    "接着便头也不回的.......走进了校门............."
    "..............."
    $ config.allow_skipping = False
    "希望我给他创造的这一没有纷争的世界.........他能够好好珍惜吧......"
    $ end = 5
    hide screen quick_menu_full
    $ quick_menu = False
    $ quick_menu_full_= False
    play music "music/end.ogg" fadeout 1.0 fadein 1.0
    call disable_shortcut from _call_disable_shortcut_13
    scene bg_none
    show end6
    with fade2
    show endtext:
       xpos 0.3
       ypos 0.7
    with dissolve
    $ renpy.pause(4, hard=False)
    show screen game_end
    with fade2
    $ renpy.pause(189, hard=False)
    $ quick_menu = True
    $ quick_menu_full_= True
    call enable_shortcut from _call_enable_shortcut_12
    $ config.allow_skipping = True
    return